{"content": "He has already moved to potentially change the infrastructure of the Russia investigation being conducted by the special counsel, Robert Mueller.\n\nOn Wednesday, Trump requested the resignation of Attorney General Jeff Sessions and received it. Matthew Whitaker, Sessions’s chief of staff, will replace him, at least on an acting basis. Before he became chief of staff last year, CNN described Mr. Whitaker this way:\n\n“Matthew Whitaker is a CNN legal commentator and former U.S. attorney who directs the Foundation for Accountability and Civic Trust (FACT), a conservative ethics watchdog group. He ran in the Republican primary for Iowa Senate in 2014.”\n\nIn an article Mr. Whitaker wrote then for CNN under the headline “Mueller’s Investigation of Trump Is Going Too Far,” he complained:\n\nIt does not take a lawyer or even a former federal prosecutor like myself to conclude that investigating Donald Trump’s finances or his family’s finances falls completely outside of the realm of his 2016 campaign and allegations that the campaign coordinated with the Russian government or anyone else. That goes beyond the scope of the appointment of the special counsel.\n\nIn another part of the article Whitaker wrote:\n\nAny investigation into President Trump’s finances or the finances of his family would require Mueller to return to Rod Rosenstein for additional authority under Mueller’s appointment as special counsel. If he were to continue to investigate the financial relationships without a broadened scope in his appointment, then this would raise serious concerns that the special counsel’s investigation was a mere witch hunt. If Mueller is indeed going down this path, Rosenstein should act to ensure the investigation is within its jurisdiction and within the authority of the original directive.\n\nIt is unclear at this point how this staff change will affect Mueller and his investigation, now that oversight for his work is being taken away from Rosenstein. But there is no way to view this move and not worry about the future of the investigation.\n\nTrump now has at least two avenues to appoint a permanent successor to Jeff Sessions: Send a new nominee before a more favorable Senate with even more Republican votes, or make a recess appointment over the holidays.\n\nAs Steve Vladeck pointed out last year in Slate:\n\nArticle II, Section 2, Clause 3 of the U.S. Constitution empowers the president “to fill up all Vacancies that may happen during the Recess of the Senate, by granting Commissions which shall expire at the End of their next Session.” And as the Supreme Court concluded three years ago in the Noel Canning case, “the Recess of the Senate” can include just about any formal recess that lasts 10 or more days — no matter whether it’s an intersession or intrasession recess — and the vacancy at issue need not arise during the recess. (Both these holdings were over the nominal dissents of four of the more conservative justices.)\n\nAs Vladeck explained, the Senate need only recess for 10 or more days with no formal business on the Senate floor — for the Christmas holidays, for instance — and “Trump could simply recess-appoint whoever he wants to serve as attorney general until the end of the next Senate session.” In this case, that next session would end in January 2020.\n\nThe incoming Democratic majority in the House would have absolutely no say in this.\n\nDemocrats did well in the elections for the House in part because representation there is a reflection of where people are. The Senate, on the other hand, is tied to land. Indeed, the fewer people in these states, many of them solidly Republican, the more weight each person’s vote carries. The Electoral College lives between the two equations.", "words": [["He", "already", "moved", "potentially", "change", "infrastructure", "Russia", "investigation", "conducted", "special", "counsel", ",", "Robert", "Mueller", "."], ["On", "Wednesday", ",", "Trump", "requested", "resignation", "Attorney", "General", "Jeff", "Sessions", "received", "."], ["Matthew", "Whitaker", ",", "Sessions", "’", "chief", "staff", ",", "replace", ",", "least", "acting", "basis", "."], ["Before", "became", "chief", "staff", "last", "year", ",", "CNN", "described", "Mr", "."], ["Whitaker", "way", ":", "“", "Matthew", "Whitaker", "CNN", "legal", "commentator", "former", "U.S", "."], ["attorney", "directs", "Foundation", "Accountability", "Civic", "Trust", "(", "FACT", ")", ",", "conservative", "ethic", "watchdog", "group", "."], ["He", "ran", "Republican", "primary", "Iowa", "Senate", "2014.", "”", "In", "article", "Mr", "."], ["Whitaker", "wrote", "CNN", "headline", "“", "Mueller", "’", "Investigation", "Trump", "Is", "Going", "Too", "Far", ",", "”", "complained", ":", "It", "take", "lawyer", "even", "former", "federal", "prosecutor", "like", "conclude", "investigating", "Donald", "Trump", "’", "finance", "family", "’", "finance", "fall", "completely", "outside", "realm", "2016", "campaign", "allegation", "campaign", "coordinated", "Russian", "government", "anyone", "else", "."], ["That", "go", "beyond", "scope", "appointment", "special", "counsel", "."], ["In", "another", "part", "article", "Whitaker", "wrote", ":", "Any", "investigation", "President", "Trump", "’", "finance", "finance", "family", "would", "require", "Mueller", "return", "Rod", "Rosenstein", "additional", "authority", "Mueller", "’", "appointment", "special", "counsel", "."], ["If", "continue", "investigate", "financial", "relationship", "without", "broadened", "scope", "appointment", ",", "would", "raise", "serious", "concern", "special", "counsel", "’", "investigation", "mere", "witch", "hunt", "."], ["If", "Mueller", "indeed", "going", "path", ",", "Rosenstein", "act", "ensure", "investigation", "within", "jurisdiction", "within", "authority", "original", "directive", "."], ["It", "unclear", "point", "staff", "change", "affect", "Mueller", "investigation", ",", "oversight", "work", "taken", "away", "Rosenstein", "."], ["But", "way", "view", "move", "worry", "future", "investigation", "."], ["Trump", "least", "two", "avenue", "appoint", "permanent", "successor", "Jeff", "Sessions", ":", "Send", "new", "nominee", "favorable", "Senate", "even", "Republican", "vote", ",", "make", "recess", "appointment", "holiday", "."], ["As", "Steve", "Vladeck", "pointed", "last", "year", "Slate", ":", "Article", "II", ",", "Section", "2", ",", "Clause", "3", "U.S", "."], ["Constitution", "empowers", "president", "“", "fill", "Vacancies", "may", "happen", "Recess", "Senate", ",", "granting", "Commissions", "shall", "expire", "End", "next", "Session.", "”", "And", "Supreme", "Court", "concluded", "three", "year", "ago", "Noel", "Canning", "case", ",", "“", "Recess", "Senate", "”", "include", "formal", "recess", "last", "10", "day", "—", "matter", "whether", "’", "intersession", "intrasession", "recess", "—", "vacancy", "issue", "need", "arise", "recess", "."], ["(", "Both", "holding", "nominal", "dissent", "four", "conservative", "justice", ".", ")"], ["As", "Vladeck", "explained", ",", "Senate", "need", "recess", "10", "day", "formal", "business", "Senate", "floor", "—", "Christmas", "holiday", ",", "instance", "—", "“", "Trump", "could", "simply", "recess-appoint", "whoever", "want", "serve", "attorney", "general", "end", "next", "Senate", "session.", "”", "In", "case", ",", "next", "session", "would", "end", "January", "2020", "."], ["The", "incoming", "Democratic", "majority", "House", "would", "absolutely", "say", "."], ["Democrats", "well", "election", "House", "part", "representation", "reflection", "people", "."], ["The", "Senate", ",", "hand", ",", "tied", "land", "."], ["Indeed", ",", "fewer", "people", "state", ",", "many", "solidly", "Republican", ",", "weight", "person", "’", "vote", "carry", "."], ["The", "Electoral", "College", "life", "two", "equation", "."]], "sentences": ["He has already moved to potentially change the infrastructure of the Russia investigation being conducted by the special counsel, Robert Mueller.", "On Wednesday, Trump requested the resignation of Attorney General Jeff Sessions and received it.", "Matthew Whitaker, Sessions’s chief of staff, will replace him, at least on an acting basis.", "Before he became chief of staff last year, CNN described Mr.", "Whitaker this way:\n\n“Matthew Whitaker is a CNN legal commentator and former U.S.", "attorney who directs the Foundation for Accountability and Civic Trust (FACT), a conservative ethics watchdog group.", "He ran in the Republican primary for Iowa Senate in 2014.”\n\nIn an article Mr.", "Whitaker wrote then for CNN under the headline “Mueller’s Investigation of Trump Is Going Too Far,” he complained:\n\nIt does not take a lawyer or even a former federal prosecutor like myself to conclude that investigating Donald Trump’s finances or his family’s finances falls completely outside of the realm of his 2016 campaign and allegations that the campaign coordinated with the Russian government or anyone else.", "That goes beyond the scope of the appointment of the special counsel.", "In another part of the article Whitaker wrote:\n\nAny investigation into President Trump’s finances or the finances of his family would require Mueller to return to Rod Rosenstein for additional authority under Mueller’s appointment as special counsel.", "If he were to continue to investigate the financial relationships without a broadened scope in his appointment, then this would raise serious concerns that the special counsel’s investigation was a mere witch hunt.", "If Mueller is indeed going down this path, Rosenstein should act to ensure the investigation is within its jurisdiction and within the authority of the original directive.", "It is unclear at this point how this staff change will affect Mueller and his investigation, now that oversight for his work is being taken away from Rosenstein.", "But there is no way to view this move and not worry about the future of the investigation.", "Trump now has at least two avenues to appoint a permanent successor to Jeff Sessions: Send a new nominee before a more favorable Senate with even more Republican votes, or make a recess appointment over the holidays.", "As Steve Vladeck pointed out last year in Slate:\n\nArticle II, Section 2, Clause 3 of the U.S.", "Constitution empowers the president “to fill up all Vacancies that may happen during the Recess of the Senate, by granting Commissions which shall expire at the End of their next Session.” And as the Supreme Court concluded three years ago in the Noel Canning case, “the Recess of the Senate” can include just about any formal recess that lasts 10 or more days — no matter whether it’s an intersession or intrasession recess — and the vacancy at issue need not arise during the recess.", "(Both these holdings were over the nominal dissents of four of the more conservative justices.)", "As Vladeck explained, the Senate need only recess for 10 or more days with no formal business on the Senate floor — for the Christmas holidays, for instance — and “Trump could simply recess-appoint whoever he wants to serve as attorney general until the end of the next Senate session.” In this case, that next session would end in January 2020.", "The incoming Democratic majority in the House would have absolutely no say in this.", "Democrats did well in the elections for the House in part because representation there is a reflection of where people are.", "The Senate, on the other hand, is tied to land.", "Indeed, the fewer people in these states, many of them solidly Republican, the more weight each person’s vote carries.", "The Electoral College lives between the two equations."]}