{"content": "According to Tesla CEO Elon Musk, the automaker was teetering on the edge of disaster earlier this year. “Tesla faced a really severe threat of death due to the Model 3 production ramp,” Musk told Axios during a video interview on HBO. “Essentially the company was bleeding money like crazy and just if we didn’t solve these problems in a very short period of time, we would die. And it was extremely difficult to solve them.”\n\nMusk said Tesla was within “single-digit weeks” of an unrecoverable catastrophe. While we appreciate his present candor, the assertion doesn’t mesh with comments made earlier.\n\nIn fact, Elon was down on the automotive firm needing more funds every since it posted its 2011 financial results. “Tesla does not need to ever raise another funding round,” he said in response to a question on the company’s cash position back in February of 2012. “We may want to do so, but we are in a strong cash position, and we don’t need to.”\n\nThat narrative has been revisited several times, with the most recent examples occurring this summer when Musk said Tesla would not be raising equity at any point. “Are we running low on money? The answer is no,” he said last August. The CEO even joked that the company had gone bankrupt for April Fool’s Day 2018, in a snide response to industry analysts who claimed the automaker was quickly running out of cash.\n\nHowever, it appears the automaker actually needed quite a bit of funding to keep itself away from the cliffs of doom. Based on Musk’s interview, the period where he was sleeping at the factory this summer was also the moment when Tesla was in the worst trouble. Meanwhile. automotive outlets — including this one — suggested Tesla’s situation was more dire than it let on.\n\nFans of the brand didn’t see it, however, and often had their rebuttals at the ready. While we’d normally love to bask in the warmth of a well-earned “told you so,” the mere fact that the public’s trust in Tesla never seems to waiver is one of the reasons for its success. In fact, Musk’s hype-driven narrative was probably an essential piece of Tesla’s overall strategy. It accomplished its goals, eventually hitting Model 3 production targets without additional fundraising — albeit with some serious hiccups.\n\nMusk’s attempt to take the company private was a big distraction over the summer and the Model 3 has still spent the majority of its life behind schedule. The Axios segment appears to illustrate just how beaten-down the process left the CEO. He admitted that nobody should work as hard as he did in 2018, adopting a defeated posture. “It hurts my brain and my heart,” he explained.”It is not recommended for anyone. I just did it because if I didn’t do it … there was a good chance Tesla would die.”\n\nHowever, it doesn’t change the fact that the company’s leadership wasn’t upfront about its situation. But when has that ever been the case with an automaker? They alway promise the moon while delivering the closest approximation they can muster. While this might feel like a slap in the face, it’s really just another reason we should keep our eyes wide open when watching the industry.\n\n[Image: Tesla Motors]", "words": [["According", "Tesla", "CEO", "Elon", "Musk", ",", "automaker", "teetering", "edge", "disaster", "earlier", "year", "."], ["“", "Tesla", "faced", "really", "severe", "threat", "death", "due", "Model", "3", "production", "ramp", ",", "”", "Musk", "told", "Axios", "video", "interview", "HBO", "."], ["“", "Essentially", "company", "bleeding", "money", "like", "crazy", "’", "solve", "problem", "short", "period", "time", ",", "would", "die", "."], ["And", "extremely", "difficult", "solve", "them.", "”", "Musk", "said", "Tesla", "within", "“", "single-digit", "week", "”", "unrecoverable", "catastrophe", "."], ["While", "appreciate", "present", "candor", ",", "assertion", "’", "mesh", "comment", "made", "earlier", "."], ["In", "fact", ",", "Elon", "automotive", "firm", "needing", "fund", "every", "since", "posted", "2011", "financial", "result", "."], ["“", "Tesla", "need", "ever", "raise", "another", "funding", "round", ",", "”", "said", "response", "question", "company", "’", "cash", "position", "back", "February", "2012", "."], ["“", "We", "may", "want", ",", "strong", "cash", "position", ",", "’", "need", "to.", "”", "That", "narrative", "revisited", "several", "time", ",", "recent", "example", "occurring", "summer", "Musk", "said", "Tesla", "would", "raising", "equity", "point", "."], ["“", "Are", "running", "low", "money", "?"], ["The", "answer", ",", "”", "said", "last", "August", "."], ["The", "CEO", "even", "joked", "company", "gone", "bankrupt", "April", "Fool", "’", "Day", "2018", ",", "snide", "response", "industry", "analyst", "claimed", "automaker", "quickly", "running", "cash", "."], ["However", ",", "appears", "automaker", "actually", "needed", "quite", "bit", "funding", "keep", "away", "cliff", "doom", "."], ["Based", "Musk", "’", "interview", ",", "period", "sleeping", "factory", "summer", "also", "moment", "Tesla", "worst", "trouble", "."], ["Meanwhile", "."], ["automotive", "outlet", "—", "including", "one", "—", "suggested", "Tesla", "’", "situation", "dire", "let", "."], ["Fans", "brand", "’", "see", ",", "however", ",", "often", "rebuttal", "ready", "."], ["While", "’", "normally", "love", "bask", "warmth", "well-earned", "“", "told", ",", "”", "mere", "fact", "public", "’", "trust", "Tesla", "never", "seems", "waiver", "one", "reason", "success", "."], ["In", "fact", ",", "Musk", "’", "hype-driven", "narrative", "probably", "essential", "piece", "Tesla", "’", "overall", "strategy", "."], ["It", "accomplished", "goal", ",", "eventually", "hitting", "Model", "3", "production", "target", "without", "additional", "fundraising", "—", "albeit", "serious", "hiccup", "."], ["Musk", "’", "attempt", "take", "company", "private", "big", "distraction", "summer", "Model", "3", "still", "spent", "majority", "life", "behind", "schedule", "."], ["The", "Axios", "segment", "appears", "illustrate", "beaten-down", "process", "left", "CEO", "."], ["He", "admitted", "nobody", "work", "hard", "2018", ",", "adopting", "defeated", "posture", "."], ["“", "It", "hurt", "brain", "heart", ",", "”", "explained.", "”", "It", "recommended", "anyone", "."], ["I", "I", "’", "…", "good", "chance", "Tesla", "would", "die.", "”", "However", ",", "’", "change", "fact", "company", "’", "leadership", "’", "upfront", "situation", "."], ["But", "ever", "case", "automaker", "?"], ["They", "alway", "promise", "moon", "delivering", "closest", "approximation", "muster", "."], ["While", "might", "feel", "like", "slap", "face", ",", "’", "really", "another", "reason", "keep", "eye", "wide", "open", "watching", "industry", "."], ["[", "Image", ":", "Tesla", "Motors", "]"]], "sentences": ["According to Tesla CEO Elon Musk, the automaker was teetering on the edge of disaster earlier this year.", "“Tesla faced a really severe threat of death due to the Model 3 production ramp,” Musk told Axios during a video interview on HBO.", "“Essentially the company was bleeding money like crazy and just if we didn’t solve these problems in a very short period of time, we would die.", "And it was extremely difficult to solve them.”\n\nMusk said Tesla was within “single-digit weeks” of an unrecoverable catastrophe.", "While we appreciate his present candor, the assertion doesn’t mesh with comments made earlier.", "In fact, Elon was down on the automotive firm needing more funds every since it posted its 2011 financial results.", "“Tesla does not need to ever raise another funding round,” he said in response to a question on the company’s cash position back in February of 2012.", "“We may want to do so, but we are in a strong cash position, and we don’t need to.”\n\nThat narrative has been revisited several times, with the most recent examples occurring this summer when Musk said Tesla would not be raising equity at any point.", "“Are we running low on money?", "The answer is no,” he said last August.", "The CEO even joked that the company had gone bankrupt for April Fool’s Day 2018, in a snide response to industry analysts who claimed the automaker was quickly running out of cash.", "However, it appears the automaker actually needed quite a bit of funding to keep itself away from the cliffs of doom.", "Based on Musk’s interview, the period where he was sleeping at the factory this summer was also the moment when Tesla was in the worst trouble.", "Meanwhile.", "automotive outlets — including this one — suggested Tesla’s situation was more dire than it let on.", "Fans of the brand didn’t see it, however, and often had their rebuttals at the ready.", "While we’d normally love to bask in the warmth of a well-earned “told you so,” the mere fact that the public’s trust in Tesla never seems to waiver is one of the reasons for its success.", "In fact, Musk’s hype-driven narrative was probably an essential piece of Tesla’s overall strategy.", "It accomplished its goals, eventually hitting Model 3 production targets without additional fundraising — albeit with some serious hiccups.", "Musk’s attempt to take the company private was a big distraction over the summer and the Model 3 has still spent the majority of its life behind schedule.", "The Axios segment appears to illustrate just how beaten-down the process left the CEO.", "He admitted that nobody should work as hard as he did in 2018, adopting a defeated posture.", "“It hurts my brain and my heart,” he explained.”It is not recommended for anyone.", "I just did it because if I didn’t do it … there was a good chance Tesla would die.”\n\nHowever, it doesn’t change the fact that the company’s leadership wasn’t upfront about its situation.", "But when has that ever been the case with an automaker?", "They alway promise the moon while delivering the closest approximation they can muster.", "While this might feel like a slap in the face, it’s really just another reason we should keep our eyes wide open when watching the industry.", "[Image: Tesla Motors]"]}