{"content": "Days before the first round of voting in the Jerusalem mayoral election on October 30, a widely circulated Israeli newspaper reported on the existence of bombshell recordings of front-runner candidate Moshe Lion, a longtime friend of Defense Minister Avigdor Liberman, who was backed by both the ultra-Orthodox Shas and Degel HaTorah factions in the bitterly contested race.\n\nIn the transcript, published by the Yedioth Ahronoth daily, Lion let activists in on what he reportedly described as a “national secret:” In exchange for Haredi leaders’ support for his candidacy, Liberman had allegedly promised to promote a softened version of a Knesset law to draft ultra-Orthodox students into the military. The issue will work itself out, Lion was said to reassure supporters several months ago, telling them that Liberman and the ultra-Orthodox party officials had met to discuss the issue.\n\nEarly on Wednesday, Lion declared victory in the Jerusalem mayoral runoff, though several thousand outstanding votes must still be counted. Hours later, Liberman resigned from the Defense Ministry and government over the prime minister’s policies on Gaza and called for early elections. Whatever promises Lion may have made will now seemingly have to wait.\n\nGet The Times of Israel's Daily Edition by email and never miss our top stories Free Sign Up\n\nPrime Minister Benjamin Netanyahu’s Likud party has reassured coalition partners — now numbering 61 of the 120 MKs — that there is no need for early elections. But an ultimatum by Jewish Home party leader Naftali Bennett demanding the defense portfolio, which the premier has already said he will retain for himself, appears likely to send the country to a snap poll in several months’ time. The elections are currently scheduled to be held in November 2019.\n\nAs the political drama unfolds in the coming days, the ultra-Orthodox enlistment bill — a keystone issue for the ultra-Orthodox coalition partners — will likely weigh heavily on Netanyahu’s mind. Though long rumored to be seeking early elections to buffer himself against a possible impending criminal indictment, the prime minister will also be seeking to close political deals ensuring that he, and none other, will be tasked by elected parties to form the state’s next governing coalition after elections.\n\nWhich is why, as Liberman bows out, the Haredi parties may still receive their coveted softened enlistment bill. But Netanyahu will still need to find support to pass the measure, which may mean giving in to Jewish Home’s demand.\n\nA looming December 2 deadline\n\nThe ultra-Orthodox enlistment bill must be passed by a December 2 deadline set by the Supreme Court. If new legislation is not voted into law, current deferral regulations would expire with the deadline and thousands of yeshiva students would find themselves unable to renew their deferments, making them eligible to be drafted by the IDF.\n\nThe current bill, written by the Defense Ministry, sets minimum yearly targets for ultra-Orthodox conscription that, if not met, would result in financial sanctions on the yeshivas where they study. At the same time, it also formalizes exemptions for the vast majority of yeshiva students. Ultra-Orthodox yeshiva students have been largely exempt from Israel’s military draft since then-defense minister David Ben-Gurion exempted 400 students from service in 1949 on the grounds that “their studies are their profession.” Previous legislation to regulate the 70-year-old issue has been disqualified by the top court.\n\nThe government’s United Torah Judaism party had opposed the Defense Ministry version of the draft bill but, signaling that it does not intend to bring down the government over the issue, the Council of Torah Sages of Agudat Yisrael in October agreed to consider backing the Defense Ministry’s bill if “a few changes are made,” a source within the party said.\n\nLiberman, who heads the staunchly secular Yisrael Beytenu party, had previously said he will not accept any change to the legislation.\n\nBut with Liberman now out of the picture, the ultra-Orthodox parties are likely to pressure Netanyahu to amend the bill and speedily pass it into law in exchange for support for his leadership after the next election.\n\nIf elections prove inevitable, Netanyahu may also gamble that the ultra-Orthodox parties, draft law or not, would continue to be loyal to him after the results of the next elections emerge.\n\nOther factors that will prove essential in the political decision-making process will include the Supreme Court’s willingness to extend the state deadline due to early elections (the court in September 2017 originally gave the government one year to advance the legislation, and later extended it by three months).\n\nAnother extension could solve, or at least delay, the premier’s conundrum. To persuade the court to again delay the timeline, however, will likely require Netanyahu to call early elections first, and then appeal to the court for a postponement due to the political developments.\n\nToo high a cost?\n\nThe notion that the government could pass a draft law in mere weeks with just 61 MKs is not unrealistic: The governing coalition had just a two seat edge over the opposition for a year between its founding in mid-2015 and until Liberman’s Yisrael Beytenu joining the coalition in March 2016.\n\nDuring that time, the coalition passed an amendment rolling back ultra-Orthodox draft reforms that were advanced by the previous government. With just 49 lawmakers in favor, the government was buoyed by the Arab lawmakers’ refusal to vote on any legislation related to the military draft.\n\nThe opposition’s Yesh Atid party had previously announced it would support the Defense Ministry’s version of the 2018 enlistment bill, but would likely refrain from backing a softened, revised edition spearheaded by the Haredi parties.\n\nThe coalition’s Kulanu party, long seen as a moderating force in the government, has yet to ever significantly break ranks to oppose centerpiece bills advanced by the government and prime minister — even if it occasionally spoke out against the legislation.\n\nBut to persuade Bennett’s right-wing Jewish Home party to support such a measure, just a year before new elections are set to be held, will likely require Netanyahu to hand over the keys to the Defense Ministry for the final 12 months of this government’s existence — or until the enlistment law is passed.\n\nBennett is a persistent, vocal critic of Netanyahu’s security policy from the right: Netanyahu has said he will do everything he can to avoid “unnecessary wars” with Gaza; Bennett has consistently called for a more punishing Israeli retaliation to rocket fire and border protests.\n\nStill stinging from Liberman’s critique of his approach on Gaza, appointing another outspoken hawk to the post may be too high a price for the prime minister to bear.\n\nTimes of Israel staff contributed to this report.", "words": [["Days", "first", "round", "voting", "Jerusalem", "mayoral", "election", "October", "30", ",", "widely", "circulated", "Israeli", "newspaper", "reported", "existence", "bombshell", "recording", "front-runner", "candidate", "Moshe", "Lion", ",", "longtime", "friend", "Defense", "Minister", "Avigdor", "Liberman", ",", "backed", "ultra-Orthodox", "Shas", "Degel", "HaTorah", "faction", "bitterly", "contested", "race", "."], ["In", "transcript", ",", "published", "Yedioth", "Ahronoth", "daily", ",", "Lion", "let", "activist", "reportedly", "described", "“", "national", "secret", ":", "”", "In", "exchange", "Haredi", "leader", "’", "support", "candidacy", ",", "Liberman", "allegedly", "promised", "promote", "softened", "version", "Knesset", "law", "draft", "ultra-Orthodox", "student", "military", "."], ["The", "issue", "work", ",", "Lion", "said", "reassure", "supporter", "several", "month", "ago", ",", "telling", "Liberman", "ultra-Orthodox", "party", "official", "met", "discus", "issue", "."], ["Early", "Wednesday", ",", "Lion", "declared", "victory", "Jerusalem", "mayoral", "runoff", ",", "though", "several", "thousand", "outstanding", "vote", "must", "still", "counted", "."], ["Hours", "later", ",", "Liberman", "resigned", "Defense", "Ministry", "government", "prime", "minister", "’", "policy", "Gaza", "called", "early", "election", "."], ["Whatever", "promise", "Lion", "may", "made", "seemingly", "wait", "."], ["Get", "The", "Times", "Israel", "'s", "Daily", "Edition", "email", "never", "miss", "top", "story", "Free", "Sign", "Up", "Prime", "Minister", "Benjamin", "Netanyahu", "’", "Likud", "party", "reassured", "coalition", "partner", "—", "numbering", "61", "120", "MKs", "—", "need", "early", "election", "."], ["But", "ultimatum", "Jewish", "Home", "party", "leader", "Naftali", "Bennett", "demanding", "defense", "portfolio", ",", "premier", "already", "said", "retain", ",", "appears", "likely", "send", "country", "snap", "poll", "several", "month", "’", "time", "."], ["The", "election", "currently", "scheduled", "held", "November", "2019", "."], ["As", "political", "drama", "unfolds", "coming", "day", ",", "ultra-Orthodox", "enlistment", "bill", "—", "keystone", "issue", "ultra-Orthodox", "coalition", "partner", "—", "likely", "weigh", "heavily", "Netanyahu", "’", "mind", "."], ["Though", "long", "rumored", "seeking", "early", "election", "buffer", "possible", "impending", "criminal", "indictment", ",", "prime", "minister", "also", "seeking", "close", "political", "deal", "ensuring", ",", "none", ",", "tasked", "elected", "party", "form", "state", "’", "next", "governing", "coalition", "election", "."], ["Which", ",", "Liberman", "bow", ",", "Haredi", "party", "may", "still", "receive", "coveted", "softened", "enlistment", "bill", "."], ["But", "Netanyahu", "still", "need", "find", "support", "pas", "measure", ",", "may", "mean", "giving", "Jewish", "Home", "’", "demand", "."], ["A", "looming", "December", "2", "deadline", "The", "ultra-Orthodox", "enlistment", "bill", "must", "passed", "December", "2", "deadline", "set", "Supreme", "Court", "."], ["If", "new", "legislation", "voted", "law", ",", "current", "deferral", "regulation", "would", "expire", "deadline", "thousand", "yeshiva", "student", "would", "find", "unable", "renew", "deferment", ",", "making", "eligible", "drafted", "IDF", "."], ["The", "current", "bill", ",", "written", "Defense", "Ministry", ",", "set", "minimum", "yearly", "target", "ultra-Orthodox", "conscription", ",", "met", ",", "would", "result", "financial", "sanction", "yeshiva", "study", "."], ["At", "time", ",", "also", "formalizes", "exemption", "vast", "majority", "yeshiva", "student", "."], ["Ultra-Orthodox", "yeshiva", "student", "largely", "exempt", "Israel", "’", "military", "draft", "since", "then-defense", "minister", "David", "Ben-Gurion", "exempted", "400", "student", "service", "1949", "ground", "“", "study", "profession.", "”", "Previous", "legislation", "regulate", "70-year-old", "issue", "disqualified", "top", "court", "."], ["The", "government", "’", "United", "Torah", "Judaism", "party", "opposed", "Defense", "Ministry", "version", "draft", "bill", ",", "signaling", "intend", "bring", "government", "issue", ",", "Council", "Torah", "Sages", "Agudat", "Yisrael", "October", "agreed", "consider", "backing", "Defense", "Ministry", "’", "bill", "“", "change", "made", ",", "”", "source", "within", "party", "said", "."], ["Liberman", ",", "head", "staunchly", "secular", "Yisrael", "Beytenu", "party", ",", "previously", "said", "accept", "change", "legislation", "."], ["But", "Liberman", "picture", ",", "ultra-Orthodox", "party", "likely", "pressure", "Netanyahu", "amend", "bill", "speedily", "pas", "law", "exchange", "support", "leadership", "next", "election", "."], ["If", "election", "prove", "inevitable", ",", "Netanyahu", "may", "also", "gamble", "ultra-Orthodox", "party", ",", "draft", "law", ",", "would", "continue", "loyal", "result", "next", "election", "emerge", "."], ["Other", "factor", "prove", "essential", "political", "decision-making", "process", "include", "Supreme", "Court", "’", "willingness", "extend", "state", "deadline", "due", "early", "election", "(", "court", "September", "2017", "originally", "gave", "government", "one", "year", "advance", "legislation", ",", "later", "extended", "three", "month", ")", "."], ["Another", "extension", "could", "solve", ",", "least", "delay", ",", "premier", "’", "conundrum", "."], ["To", "persuade", "court", "delay", "timeline", ",", "however", ",", "likely", "require", "Netanyahu", "call", "early", "election", "first", ",", "appeal", "court", "postponement", "due", "political", "development", "."], ["Too", "high", "cost", "?"], ["The", "notion", "government", "could", "pas", "draft", "law", "mere", "week", "61", "MKs", "unrealistic", ":", "The", "governing", "coalition", "two", "seat", "edge", "opposition", "year", "founding", "mid-2015", "Liberman", "’", "Yisrael", "Beytenu", "joining", "coalition", "March", "2016", "."], ["During", "time", ",", "coalition", "passed", "amendment", "rolling", "back", "ultra-Orthodox", "draft", "reform", "advanced", "previous", "government", "."], ["With", "49", "lawmaker", "favor", ",", "government", "buoyed", "Arab", "lawmaker", "’", "refusal", "vote", "legislation", "related", "military", "draft", "."], ["The", "opposition", "’", "Yesh", "Atid", "party", "previously", "announced", "would", "support", "Defense", "Ministry", "’", "version", "2018", "enlistment", "bill", ",", "would", "likely", "refrain", "backing", "softened", ",", "revised", "edition", "spearheaded", "Haredi", "party", "."], ["The", "coalition", "’", "Kulanu", "party", ",", "long", "seen", "moderating", "force", "government", ",", "yet", "ever", "significantly", "break", "rank", "oppose", "centerpiece", "bill", "advanced", "government", "prime", "minister", "—", "even", "occasionally", "spoke", "legislation", "."], ["But", "persuade", "Bennett", "’", "right-wing", "Jewish", "Home", "party", "support", "measure", ",", "year", "new", "election", "set", "held", ",", "likely", "require", "Netanyahu", "hand", "key", "Defense", "Ministry", "final", "12", "month", "government", "’", "existence", "—", "enlistment", "law", "passed", "."], ["Bennett", "persistent", ",", "vocal", "critic", "Netanyahu", "’", "security", "policy", "right", ":", "Netanyahu", "said", "everything", "avoid", "“", "unnecessary", "war", "”", "Gaza", ";", "Bennett", "consistently", "called", "punishing", "Israeli", "retaliation", "rocket", "fire", "border", "protest", "."], ["Still", "stinging", "Liberman", "’", "critique", "approach", "Gaza", ",", "appointing", "another", "outspoken", "hawk", "post", "may", "high", "price", "prime", "minister", "bear", "."], ["Times", "Israel", "staff", "contributed", "report", "."]], "sentences": ["Days before the first round of voting in the Jerusalem mayoral election on October 30, a widely circulated Israeli newspaper reported on the existence of bombshell recordings of front-runner candidate Moshe Lion, a longtime friend of Defense Minister Avigdor Liberman, who was backed by both the ultra-Orthodox Shas and Degel HaTorah factions in the bitterly contested race.", "In the transcript, published by the Yedioth Ahronoth daily, Lion let activists in on what he reportedly described as a “national secret:” In exchange for Haredi leaders’ support for his candidacy, Liberman had allegedly promised to promote a softened version of a Knesset law to draft ultra-Orthodox students into the military.", "The issue will work itself out, Lion was said to reassure supporters several months ago, telling them that Liberman and the ultra-Orthodox party officials had met to discuss the issue.", "Early on Wednesday, Lion declared victory in the Jerusalem mayoral runoff, though several thousand outstanding votes must still be counted.", "Hours later, Liberman resigned from the Defense Ministry and government over the prime minister’s policies on Gaza and called for early elections.", "Whatever promises Lion may have made will now seemingly have to wait.", "Get The Times of Israel's Daily Edition by email and never miss our top stories Free Sign Up\n\nPrime Minister Benjamin Netanyahu’s Likud party has reassured coalition partners — now numbering 61 of the 120 MKs — that there is no need for early elections.", "But an ultimatum by Jewish Home party leader Naftali Bennett demanding the defense portfolio, which the premier has already said he will retain for himself, appears likely to send the country to a snap poll in several months’ time.", "The elections are currently scheduled to be held in November 2019.", "As the political drama unfolds in the coming days, the ultra-Orthodox enlistment bill — a keystone issue for the ultra-Orthodox coalition partners — will likely weigh heavily on Netanyahu’s mind.", "Though long rumored to be seeking early elections to buffer himself against a possible impending criminal indictment, the prime minister will also be seeking to close political deals ensuring that he, and none other, will be tasked by elected parties to form the state’s next governing coalition after elections.", "Which is why, as Liberman bows out, the Haredi parties may still receive their coveted softened enlistment bill.", "But Netanyahu will still need to find support to pass the measure, which may mean giving in to Jewish Home’s demand.", "A looming December 2 deadline\n\nThe ultra-Orthodox enlistment bill must be passed by a December 2 deadline set by the Supreme Court.", "If new legislation is not voted into law, current deferral regulations would expire with the deadline and thousands of yeshiva students would find themselves unable to renew their deferments, making them eligible to be drafted by the IDF.", "The current bill, written by the Defense Ministry, sets minimum yearly targets for ultra-Orthodox conscription that, if not met, would result in financial sanctions on the yeshivas where they study.", "At the same time, it also formalizes exemptions for the vast majority of yeshiva students.", "Ultra-Orthodox yeshiva students have been largely exempt from Israel’s military draft since then-defense minister David Ben-Gurion exempted 400 students from service in 1949 on the grounds that “their studies are their profession.” Previous legislation to regulate the 70-year-old issue has been disqualified by the top court.", "The government’s United Torah Judaism party had opposed the Defense Ministry version of the draft bill but, signaling that it does not intend to bring down the government over the issue, the Council of Torah Sages of Agudat Yisrael in October agreed to consider backing the Defense Ministry’s bill if “a few changes are made,” a source within the party said.", "Liberman, who heads the staunchly secular Yisrael Beytenu party, had previously said he will not accept any change to the legislation.", "But with Liberman now out of the picture, the ultra-Orthodox parties are likely to pressure Netanyahu to amend the bill and speedily pass it into law in exchange for support for his leadership after the next election.", "If elections prove inevitable, Netanyahu may also gamble that the ultra-Orthodox parties, draft law or not, would continue to be loyal to him after the results of the next elections emerge.", "Other factors that will prove essential in the political decision-making process will include the Supreme Court’s willingness to extend the state deadline due to early elections (the court in September 2017 originally gave the government one year to advance the legislation, and later extended it by three months).", "Another extension could solve, or at least delay, the premier’s conundrum.", "To persuade the court to again delay the timeline, however, will likely require Netanyahu to call early elections first, and then appeal to the court for a postponement due to the political developments.", "Too high a cost?", "The notion that the government could pass a draft law in mere weeks with just 61 MKs is not unrealistic: The governing coalition had just a two seat edge over the opposition for a year between its founding in mid-2015 and until Liberman’s Yisrael Beytenu joining the coalition in March 2016.", "During that time, the coalition passed an amendment rolling back ultra-Orthodox draft reforms that were advanced by the previous government.", "With just 49 lawmakers in favor, the government was buoyed by the Arab lawmakers’ refusal to vote on any legislation related to the military draft.", "The opposition’s Yesh Atid party had previously announced it would support the Defense Ministry’s version of the 2018 enlistment bill, but would likely refrain from backing a softened, revised edition spearheaded by the Haredi parties.", "The coalition’s Kulanu party, long seen as a moderating force in the government, has yet to ever significantly break ranks to oppose centerpiece bills advanced by the government and prime minister — even if it occasionally spoke out against the legislation.", "But to persuade Bennett’s right-wing Jewish Home party to support such a measure, just a year before new elections are set to be held, will likely require Netanyahu to hand over the keys to the Defense Ministry for the final 12 months of this government’s existence — or until the enlistment law is passed.", "Bennett is a persistent, vocal critic of Netanyahu’s security policy from the right: Netanyahu has said he will do everything he can to avoid “unnecessary wars” with Gaza; Bennett has consistently called for a more punishing Israeli retaliation to rocket fire and border protests.", "Still stinging from Liberman’s critique of his approach on Gaza, appointing another outspoken hawk to the post may be too high a price for the prime minister to bear.", "Times of Israel staff contributed to this report."]}